app/controllers/pages_controller.rb

SELECT `channels`.`channelid` FROM `channels` WHERE `channels`.`category` = 'prominent'
---
  def home
    @prominentIds = Channel.where(:category => 'prominent').pluck(:channelid)

SELECT `zipcodes`.* FROM `zipcodes` WHERE `zipcodes`.`code` = '602'
---
  def localchannels
    zipcode =  params[:zipcode]

    @localIds = []

    if (zipcode != nil && zipcode != '')

      zip1 = Zipcode.where(:code => zipcode[0,3])