app/controllers/zipcodes_controller.rb

SELECT `zipcodes`.* FROM `zipcodes`
---
  def index
    @zipcodes = Zipcode.all